_timeline_work = {
  "id": "work",
  "title": "Work",
  "format": "timeline",
  "description": "Zeeshan Hanif's work history.",
  "items": [
    {
      "title": "Google",
      "dates": "July 2019 - present",
      "description": [
        "Developing world class APIs on a simple, efficient stack.",
        "Keeping the Google Cloud Storage (GCS) JSON API up and running; my work involving performance, system, and load testing ensures that our systems can quickly, correctly, and reliably handle the millions of QPS our customers send us everyday."
      ]
    },
    {
      "title": "Alcatel­-Lucent Enterprise",
      "dates": "October 2017 - June 2018",
      "description": [
        "My internship was extended, and I began working remotely as a part-time engineer while attending school. The majority of my time was spent continuing work on my intern project. Aside from this, I had another project, briefly described below.",
        "Worked on refreshing the decade-old web interface of our network switches. This required me to work with engineers from Southern California and France to produce a requirements document.",
        "Refactored a subset of UI components specific to the VLAN configuration view, focusing on modularity and code health."
      ]
    },
    {
      "title": "Alcatel­-Lucent Enterprise",
      "dates": "July 2017 - October 2017",
      "description": [
        "Developed a ticketing platform focused on logging project progress. The goal of the platform was to allow multiple employees to function more efficiently when dealing with bugs.",
        "Worked with a legacy PHP backend and a JavaScript frontend, focused on providing employees with a responsive application to manage their tickets.",
        "Implemented a dashboard overview of tickets, import and export of tickets to Excel, and a notification system.",
        "Added monitoring resources and UI elements to the dashboard, import and export functionality to and from Excel, and a basic notification system."
      ]
    },
    {
      "title": "Daomi Design",
      "dates": "",
      "description": [
        "Worked with a student organization that developed free portfolios for students.",
        "Managed both backend and frontend applications using React, Node.js, and MySQL.",
        "Drafted requirements documentation, arranged meetings with clientele, and discussed product progress.",
        "Created responsive web applications, with a focus on passing all Google PageSpeed tests for mobile readiness and optimization."
      ]
    },
  ]
}
